+++
uuid = "reagent-intro"
tags = ["blog", "index-page"]
title = "Reagent Intro"
description = """An introduction to Clojure with Reagent."""
+++

* Clojure functions and hiccup
~defn~ defines a function in Clojure. Our function takes one ~name~ parameter and returns a vector. The last "expression" in the function is the return value.

#+BEGIN_SRC
(defn hello [name]
   [:p (str "Hello " name "!")])
#+END_SRC

#+RESULTS:
: #'user/hello

* Calling our Function
The first thing in a set of parens is a function that will be called with the following expressions as arguments. Our function will return an array ~[:p "Hello World!"]~ with a ~:keyword~ as the first item signifying the type of element to be rendered, and the content of the element in the second position.

#+BEGIN_SRC clojure
(hello "World")
#+END_SRC

#+RESULTS:
| :p | Hello World! |

Some functions can take any number of arguments, like ~str~

#+BEGIN_SRC clojure
(str "this" "function" "can" "take" "many" "args")
#+END_SRC

#+RESULTS:
: thisfunctioncantakemanyargs

